[
  {
    "title": "Computer Trends is the best!!!",
    "text": "I purchased my first home computer about 20 years ago from Jeff Easler at Computer Trends. I have bought my computers from them ever since. They are very knowledgeable and always willing to help with any questions or concerns I may have about my computer. Jeff and his employees at Computer Trends are great to work with and have a quick turn around time. They truly care about their customers and are more than willing to go the extra mile to help 1 of their customers. I will continue using Jeff and his employees at Computer Trends for all of my computer needs.",
    "author": "Angela Hairr"
  },
  {
    "title": "Great Service!",
    "text": "I have been using Computer Trends for several years and cannot imagine having to go anywhere else.  Jeff is very knowledgeable and provides amazing customer service.  Whether I am having a major issue with my computer or it is the smallest of things that I can't figure out, he is always there and willing to help me out.  This to me this is a business that truly cares about their customers.",
    "author": "Kelly Fuqua"
  },
  {
    "title": "Quality work & great service",
    "text": "Computer Trends was recommended to us about 7 years ago when my computer quit working. I had Jeff built me a desk top and have used it ever since.  Other than an virus now and then I have had no need to take this unit back to Jeff.  He has always been prompt about getting his work completed as well as completing it with top flight quality.\n\nI have recommended Computer Trends to all that ask me about who I use for my computer repairs.\n\nI can think of nothing negative to say.",
    "author": "John Foster"
  },
  {
    "title": null,
    "text": "Computer Trends was and is an answer to prayer for me with all the trouble I have had with Computers. Mr. Easler took the time to explain all the issues about my laptop. Office Depot had my computer for a week solid, then broke the keyboard, and also did not fix the computer. Computer Trends will be the place for me in the future as it relates to any problems I have with computers. Thanks Jeff Easler at Computer Trends for your help and also for the reasonable price I incurred get the virused off and fixing my problems. Thanks again and count on me letting other people know about your company and the friendly atmosphere I experienced.",
    "author": "James Johnson"
  },
  {
    "title": "Very professional",
    "text": "Jeff and crew are people you can count on to follow through on their promises and be the IT solution your company needs. I have watched them recover information from units that were torched in fires and put together solutions for all you needs.",
    "author": "david lancaster"
  },
  {
    "title": "Would recommend to anyone....",
    "text": "We use Jeff and Computer Trends for our Business The Scuba Shop. They have always been quick, friendly, and very affordable. They are very trust worthy and I would recommend them to anyone for your computer needs. Great company and Great People.",
    "author": "The Scuba Shop ."
  },
  {
    "title": "Love the Service",
    "text": "We have used Computer Trends for several years and have always had great experiences. Jeff has always been able to take care of our issues and has saved us from having further issues. Jeff and his staff are always friendly and professional to deal with.\n\nThey have done many different things to streamline our computers in our office and to make my job easier to manage.",
    "author": "Tisha Hayes"
  },
  {
    "title": "Computer Trends",
    "text": "The Easlers have been helping me with my computer needs for 30 years.  They are trusted allies and always have strived to help me with what would fix my computer - not what necessarily would make them the most money.  FOr that and for their friendship, I am grateful.  In addition, Jeff is filled with the Holy Spirit!",
    "author": "Stanford McMillan"
  },
  {
    "title": "Great service!!!!!!!!!!",
    "text": "The guys at Computer Trends have always helped me and my friends with our computer problems. I recommend them to everyone I see.",
    "author": "Terence Jeter"
  },
  {
    "title": null,
    "text": "I know Jeff for many years and he help me  and resolve all the problemes I have with my   computer,i hillly recomande him,p.v",
    "author": "pierrette v vaillancourt"
  },
  {
    "title": "Excellent Service",
    "text": "Jeff has always given me excellent service over the years and has even spoken French with me when he fixes my computer.",
    "author": "Pierrette Vailancourt"
  },
  {
    "title": "Always willing to do the best work",
    "text": "Computer Trends have a group of professionals that seem like family. They always take time and interest to help correct your computer needs no matter how large or small your project may be. A special thank you to Jeff, who just helped me with a need with my personal computer used for ministry. Thank You",
    "author": "David Duncan"
  },
  {
    "title": null,
    "text": "The people at Computer Trends are awesome. Go above and beyond their work. We have used them for years! ",
    "author": "Jeff Gilreath"
  },
  {
    "title": null,
    "text": "I would highly recommend Computer Trends for all of your computer needs. Every time I have had a question or problem, they are very quick, patient, and  efficient to meet my need. They are also very affordable! Thank you!",
    "author": "Kay Kirby"
  },
  {
    "title": "quality service is still around",
    "text": "with my job I have to work out of my home. When my hardware has a failure I know that I can count on computer trends to get me up and running in a very timely and professional manner. The guys at computer trends are very knowledgeable about today's industry and on the cutting edge of technology that helps me keep on my toes for my customers. I would suggest computer trends to work with anyone or any business needs you may have.",
    "author": "brian jonson"
  },
  {
    "title": "Thought all was lost",
    "text": "I thought I had lost everything on my computer. But the guys at computer trends were able to save everything on my hard drive and remove the viruses that cause the problem. They were very professional, and turn around time was faster than I had expected. I would recommend them to work on anybody's machines.",
    "author": "Brett Fitzgerald"
  },
  {
    "title": "Outstanding Service and Very Knowledgeable",
    "text": "The guys at Computer Trends really need took the time to explain lots of different things that I didn't understand and were very reasonable on what they charged. They spent a lot of time on my computer and didn't charge by the hour like some people do. I highly recommend them.",
    "author": "Billy Bell"
  },
  {
    "title": "Total Satisfaction - Recommend to all!",
    "text": "I'm a computer dummy and Computer Trends not only solved my problem but also educated me. I highly recommend them for any computer issues. Totally about client satisfaction.",
    "author": "Jimmy Jones"
  },
  {
    "title": "Amazing customer service!",
    "text": "Over the last 10 years I have counted on Computer Trends for all my computer needs. With this being said, they have yet to disappoint. I am always completely thrilled with the professional service I receive and at the lowest prices in the area. Would highly recommend to anyone in the upstate area.",
    "author": "Brinson Corn"
  },
  {
    "title": "Outstanding Service",
    "text": "Jeff has repaired everything that I have needed him to repair. He will fix anything concerning software and hardware. He has always shown me outstanding performance, and I will always call on him for anything that I cannot do myself. Need anything fixed ask for JEFF at Computer Trends.",
    "author": "DANIELLE ROCHESTER"
  },
  {
    "title": "Depentable and Reliable Service",
    "text": "I had several issues with my lap top computers. Jeff did fast and reliable work on both of them and my daughter never missed a assignment at school. Thanks for all of your quick and speedy service.I would recommend Computer Trends to all my friends.",
    "author": "Annette Crews"
  },
  {
    "title": "Fantastic service, as usual",
    "text": "I have used Computer Trends services twice in the past few years and have been throughly impressed both times. Jeff was able to diagnose the problem I was experiencing within thirty seconds on the phone and was able to help me fix the problem without me having to bring my computer into the store. I would highly recommend them to anyone looking for quick and professional help with solving any and all computer problems.",
    "author": "Cole Bondy"
  },
  {
    "title": "Awesome people and Super repair",
    "text": "Very courteous, friendly, and knowledgeable technicians who not only repaired my crashed computer, they were able to save and retrieve my pictures, music, games, and other information I had not backed up.  And, they did this at a very reasonable price and in just a day or two.  I couldn't ask for more and they saved me from having to buy a new computer.   Not losing all my computer information was the biggest plus.\nI highly recommend these trusting folks to everyone. Thank you for a Great Job!",
    "author": "Frank Hallman"
  },
  {
    "title": "Wonderful service",
    "text": "I've had several computer virus' etc, and have looked into places to get it fixed. Computer Trends was the best place i could find. I had an excellent experience with them, they were extremely friendly and willing to help me. They were also fast and very affordable. I highly recommend them for any computer problems.",
    "author": "Shawn Porter"
  },
  {
    "title": "Great Service and dependability",
    "text": "Prompt, courteous, and efficient.\n\nAlways pleasant and always able to resolve the situation.\n\nAlways have been completely satisfied.",
    "author": "Rita S"
  },
  {
    "title": "Great work! ",
    "text": "The team at Computer Trends did exactly what I needed in record time! Thanks! ",
    "author": "Joe  Raffo "
  },
  {
    "title": "Excellent Company & Service",
    "text": "Computer Trends is an excellent company that I would recommend to everyone!  They always go the extra mile to help you no matter what computer issue you are having; large or small.  They are always available when you need them and treat all emergencies with quick response! I would not use anyone but Computer Trends for all my personal or business computers! Great people! ",
    "author": "April Michaud"
  },
  {
    "title": "I've been dealing with these people a long time, they're great!!!",
    "text": "Computer Trends is a great place to go, they are fast, reasonable, knowledgeable, but most of all..... they don't talk a different language. They are very friendly & explain things to you where you can understand. I recommend them.\n\nDennis Kimbrell\nUpstate Cash Register",
    "author": "dennis kimbrell"
  },
  {
    "title": "Best in Town!",
    "text": "I have used Computer Trends multiple times over the years.  Jeff and his team have always provided prompt and professional service, for any problem big or small.  There is no one else I would consider going for my computer needs. They are truly the best!",
    "author": "Amy Stockman"
  },
  {
    "title": "Dependable",
    "text": "As a medical practice, we depend on promptness when an IT issue arises that we are unable to handle in-house.  Computer Trends is always just a phone call away.  We understand emergent needs with other customers may need to be addressed first based on the severity of the problem but no matter what, Thornton and Jeff make certain we are taken care of as soon as possible.  They are truly considered to be a part of our work family.  Great folks, great values, morals & work ethic and a great fit for our medical practice IT needs.",
    "author": "Donna Lancaster"
  },
  {
    "title": "Great Service",
    "text": "I have been very satisfied with my custom built computer. They listened to my needs and built my computer to match those needs. Would recommend to anyone.",
    "author": "Joyce Stacey"
  },
  {
    "title": "Excellent service",
    "text": "I got quick turnaround on my PC issue which turned out to be a bad motherboard- and got great advice on upgrading my computer.  Very courteous service, and quite reasonable diagnostic fees.  Have been doing business with them for years, and will continue to do so!!",
    "author": "Darin Dotson"
  },
  {
    "title": "Myra Upchurch   Moss Insurance Group",
    "text": "Computer Trends has always been great at solving our computer problems fast and efficiently.  Could not ask for better customer service.  Always quick to get back to us and help us with our problems.",
    "author": "Myra Upchurch"
  },
  {
    "title": "COMPUTER VIRUS",
    "text": "WE HAD A BAD PROBLEM WITH ONE OF OUR COMPUTERS THAT WE USED TO PREPARER TAXES.\n\nI CALLED COMPTER TRENDS AND JEFF EASLER CAME OUT AND REMOVED ALL VIRUS ES FROM OUR COMPUTER AND WE WERE UP AND RUNNING AGAIN WITHIN TWO HOURS.\n\nI HIGHLY RECOMMEND COMPUTER FOR ANY COMPUTER NEED/S.\n\n\nCARL R. PARKER",
    "author": "CARL PARKER"
  },
  {
    "title": "Great Service",
    "text": "I have done business with Computer Trends for several years and could not be more satisfied.  I have an insurance business and I know how important good  customer service is. They are extremely accommodating and knowledgeable.  What I value the most is the fact that when I need them, they always answer my call or return it in a timely manner.",
    "author": "Jay Moss"
  },
  {
    "title": "Best team in town!",
    "text": "Jeff is always so patient with my errors on my computer and getting it back to me in a very short time.  They are always willing to help and fix things without having to take my desktop apart. It is so convenient to have the Ninite feature as well!\n\nThis is my #1 choice for computer repairs and \"caregivers\" as it has been for several years!",
    "author": "Mary Kunak"
  },
  {
    "title": "Top Notch Service",
    "text": "I am a customer for the past twenty years.  Always get great service and very reasonable pricing.  I would highly recommend Computer Trends to anyone.",
    "author": "Steve Noblin"
  },
  {
    "title": "OUTSTANDING SERVICE",
    "text": "I have a small tax office in the winter months. I purchased new computers this year there team came over and set them up quickly and professionally. I also purchased some new printers. after getting frustrated trying to install them myself I call Jeff and he was there the next day and had me going.\n\nI would highly recommend Computer Trends to anyone and everyone,\n\nthank you Paul Edge",
    "author": "Paul Edge"
  },
  {
    "title": "Awesome service and great people!!",
    "text": "Everyone I have dealt with is wonderful!  Starting with the person who answers the phone to the person who fixes your computer problems!",
    "author": "Kammy Jones"
  },
  {
    "title": "Great service in a timely manner",
    "text": "Our practice has used the services of Computer Trends for quite a while now. They provide great service and are able to service our needs in a very timely manner. Jeff and Thornton are great to work with. I would highly recommend them.",
    "author": "Louis Martin"
  },
  {
    "title": "Excellent Service/Timely Repairs/Great Place To Purchase Your Computer",
    "text": "I have been a Computer Trends Customer since 1997.  With the exception of my laptop, which I purchased through the college I attended, every computer that I have purchased as been through Computer Trends.  Their computers are top notch and when there is a problem, Jeff and Daniel always have the repairs completed when promised and have never surprised me with extra cost.  Anyone in the Spartanburg area should make Computer Trends their ONLY consideration when buying, repairing or servicing their computer.",
    "author": "Dav W"
  },
  {
    "title": "Highly recommend! ",
    "text": "Thank you Computer Trends for your professional, prompt and reliable services. You have always been so helpful with my business and personal computer needs. ",
    "author": "Robin McAbee"
  },
  {
    "title": "Computer Repair with Confidence",
    "text": "FAST, PERFECT AND PROFESSIONAL COMPUTER REPAIR!  Always has been!",
    "author": "Hilda Jolley"
  },
  {
    "title": null,
    "text": "They are fantastic . They are very prompt about returning calls and taking care of our computer issues. I highly recommend them to anybody,",
    "author": "Angie Neal"
  },
  {
    "title": "Scary situation averted!",
    "text": "My laptop is critical to my business as a realtor, and like most people I do not do a good job of backing it up.  I ran into a situation where the machine would no longer boot up, and was very concerned for data loss.  Jeff was able in one day to get the computer hardware repaired, added some software recommended and return it to me.\n\nI hope not to need them, but glad to know they are there.\n\nChris",
    "author": "Chris Byrd"
  },
  {
    "title": null,
    "text": "Prompt , efficient service. Easy to work with.",
    "author": "Bon Nohr"
  },
  {
    "title": "Expert advise and ability to retrieve data",
    "text": "Jeff and his crew at Computer Trends have such a ability to stay on the cutting edge of technology that it is not funny.  I have had all my work done there after my first experience with them. They are able to retrieve data that I considered lost forever and maintain my machines and towers quickly and without a lot of time lost. I appreciate how I am treated there, they do not talk \"down\" to me because I do not speak the language of computers. They make me feel valued and I would recommend their work and service to anyone from the casual user to the gamer to a business needing multiple applications and uses.",
    "author": "Alex Henson"
  },
  {
    "title": "Computer Trends",
    "text": "I have been using Computer Trends located in Spartanburg SC for about 8 years. They have always done a great job for me. When something goes wrong with my computer I Do not hesitate where to take it !!They are also very friendly..I would recommend using them for any computer problems!! So go see Computer Trends on highway 9!! April Austin",
    "author": "April Austin"
  },
  {
    "title": "Have confidence in Computer Trends",
    "text": "I have used Computer Trends for many years.  They are professional and on top of the newest updates and improvements to our computer system.  If we have operating issues they are quick to fix the problem and get us back up and running in a reasonable amount of time.  They show willingness to help our company when we need to add additional computers and or software to our system for the betterment of our business.  They are reasonably priced for the expertise they offer.  I strongly recommend Computer Trends.",
    "author": "Cindy W"
  },
  {
    "title": "My review on computer trends",
    "text": "I can not say enough good things about computer trends. My first experience with this company was a computer I was told needed mother board. The person who looked at my computer opened it up and found a card was  loose and he pushed it back in.The computer worked just fine after that. I could not believe it was that simple. I have gone back there many times and have been very satisfied with what they did. I highly recommend computer trends to everyone. You won't be disappointed.",
    "author": "Robert Engley"
  },
  {
    "title": "Amazing!",
    "text": "I've never took anything there they couldn't fix! The best crew by far!!!!!",
    "author": "Tony Lawter"
  },
  {
    "title": "Absolute the finest Computer Service in the world-yep! WORLD!",
    "text": "I was going to be  more wordy er mouthy------ However--\nI will never take my LapTop anywhere else. Jeff is HONEST, FAIR, CHRISTIAN,\nAMERICAN. SPEAKS ENGLISH, and you do not have to press 1  first.\n I do not know  long Computer Trends have been in business. I would guess 30+\nyears, because I moved here as a Yankee about 16 tears ago, so that makes them\nabout 30 years in a Business that performs to the Highest standards of  business ethics. We are Blessed to have such an Honest business in the Spartanburg area\n  It is an honor to submit this,\n     GERE ABLETT",
    "author": "GERE ABLETT"
  },
  {
    "title": "Best Computer Company in the South!!",
    "text": "I have been using computer trends for years for my computer needs and they are the best and very reasonable. I would never use anyone else. Not only that they are so friendly and helpful and always go that extra mile.",
    "author": "Beverly Turner"
  }
]
